---
type: CanExecuteEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 3
tags: [revit-api, class]
---

# CanExecuteEventArgs

`Autodesk.Revit.UI.Events.CanExecuteEventArgs` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetSelectedCategoryIds | 2013 | `public ICollection < ElementId > GetSelectedCategoryIds ()` |
| Property | CanExecute | 2013 | `public bool CanExecute { get ; set ; }` |
| Property | IsChecked | 2020 | `public bool IsChecked { get ; set ; }` |